{
  "http://mindparabole.com/finance/fasb_concepts#AmortizedCostBasis" : "The amortized cost basis is the amount at which a financing receivable or investment is originated or acquired, adjusted for applicable accrued interest, accretion, or amortization of premium, discount, and net deferred fees or costs, collection of cash,  writeoffs, foreign exchange, and fair value hedge accounting adjustments",
  "http://mindparabole.com/finance/fasb_concepts#EffectiveInterestRate" : "The rate of return implicit in the financial asset, that is, the contractual interest rate adjusted for any net deferred fees or costs, premium, or discount existing at the origination or acquisition of the financial asset",
  "http://mindparabole.com/finance/fasb_concepts#HoldingGainorLoss" : "The net change in fair value of a security. The holding gain or loss does not include dividend or interest income recognized but not yet received, writeoffs, or the allowance for credit losses",
  "http://mindparabole.com/finance/fasb_concepts#RemeasurementEvent" : "A remeasurement (new basis) event is an event identified in other authoritative accounting literature, other than the measurement of an impairment under Topic 321 or credit loss under Topic 326 that requires a financial instrument to be remeasured to its fair value at the time of the event but does not require that financial instrument to be reported at fair value continually with the change in fair value recognized in earnings. Examples of remeasurement events are business combinations and significant modifications of debt as discussed in paragraph 470-50-40-6",
  "http://mindparabole.com/finance/fasb_concepts#Accretion" : "Accretion is asset and earnings growth due to business expansion, and it can occur through a company's internal growth or by way of mergers and acquisitions. Accretion is also used to account for a capital gain when an investor buys a bond at a discount and holds the bond until maturity",
  "http://mindparabole.com/finance/fasb_concepts#CollectibilityOfReceivables" : "The Company maintains allowances for doubtful accounts for estimated losses resulting from the inability of its customers to make required payments. The Company reviews a customer’s credit history before extending credit as deemed necessary, after considering the client and the size and duration of the assignment. The Company establishes an allowance for doubtful accounts based upon factors surrounding the credit risk of specified customers, historical trends, past due balances and other information. The Company considers an account past due based on the contractual payment terms. The Company has demonstrated the ability to make reasonable and reliable estimates; however, if the financial condition of the Company’s customers was to deteriorate, resulting in an impairment of their ability to make payments, additional allowances may be required.",
  "http://mindparabole.com/finance/fasb_concepts#AccountingAdjustment" : "The accounting cycle is like a circle. It begins with transaction analysis and ends with closing the books. Each and every step in between is vital to the process. There are eight general steps to the accounting cycle. Today, we're going to talk about the sixth step in the cycle - adjustments to accounts. Account adjustments, also known as adjusting entries, are entries that are made in the general journal at the end of an accounting period to bring account balances up-to-date. Unlike entries made to the general journal that are a result of business transactions, account adjustments are a result of internal events. Internal events are those events that have occurred in the business that don't involve an exchange of goods or services with another entity."
}